Repository: mayjuno/Django-MM-Ecommerce-Queen-Site
Catalog: user/locale/*/LC_MESSAGES/django.po
Languages: my

source: Home
my: မူလစာမျက်နှာ

source: User Login
my: အသုံးပြုသူဝင်ရန်

source: Login Form
my: ဝင်ရန်ပုံစံ

source: User Sign Up
my: အသုံးပြုသူမှတ်ပုံတင်မည်

source: Sign Up Form
my: အသုံးပြုသူမှတ်ပုံတင်ပုံစံ

source: Sign up
my: မှတ်ပုံတင်မည်

source: User Comments
my: အသုံးပြုသူမှတ်ချက်များ

source: Comments
my: မှတ်ချက်များ

source: Product
my: ပစ္စည်းအမည်

source: Rate
my: ထောက်ခံမှု

source: Subject
my: ခေါင်းစဥ်

source: Comment
my: မှတ်ချက်

source: Status
my: အခြေအနေ

source: Date
my: ရက်စွဲ

source: Detail
my: အသေးစိတ်

source: Delete
my: ပယ်ဖျက်မည်

source: Order Detail
my: မှာယူမှုအသေးစိတ်

source: Name Surname
my: အမည်

source: Phone
my: ဖုန်း

source: Address
my: လိပ်စာ

source: City
my: မြို့

source: Country
my: နိုင်ငံ

source: Status
my: အခြေအနေ

source: Shipping Info
my: ပို့ဆောင်မှုအခြေအနေ

source: Order Item List
my: မှာယူထားသည့်ပစ္စည်းစာရင်း

source: Id
my: စဥ်

source: Product Name
my: အမျိုးအမည်များ

source: Price
my: ဈေးနှုန်း

source: Quantity
my: အရေအတွက်

source: Amount
my: ပမာဏ

source: Order Products
my: မှာယူထားသည့်ပစ္စည်းများ

source: Order Product List
my: မှာယူထားသည့်ပစ္စည်းစာရင်း

source: Id
my: စဥ်

source: Order List
my: မှာယူမှုစာရင်း

source: First Name
my: အမည်

source: Last Name
my: နောက်ဆုံးအမည်

source: Total
my: စုစုပေါင်း

source: User Panel
my: အသုံးပြုသူနေရာ

source: User Profile
my: အသုံးပြုသူကိုယ်ရေးအချက်အလက်

source: My Orders
my: ကျွန်ုပ်၏မှာယူမှုများ

source: My Orders Product
my: ကျွန်ုပ်၏မှာယူထားသည့်ပစ္စည်း

source: My Comments
my: ကျွန်ုပ်၏မှတ်ချက်များ

source: My Favorits
my: ကျွန်ုပ်အနှစ်သက်ဆုံးများ

source: My Products
my: ကျွန်ုပ်၏ပစ္စည်းများ

source: Logout
my: ထွက်ခွါမည်

source: Change Password
my: ကုတ်ပြောင်းမည်

source: User Change Password
my: လျှိူ့ဝှက်ကုတ်ပြောင်း

source: Save changes
my: ပြောင်းလဲသိမ်းစည်းမည်

source: User Profile Info
my: အသုံးပြုသူကိုယ်ရေးအချက်အလက်

source: Update Profile
my: ကိုယ်ရေးအချက်အလက်ပြောင်းရန်

source: Email
my: အီးမေးလ်

source: User Profile Update
my: ကိုယ်ရေးအချက်အလက်ပြောင်းရန်

source: Update
my: အဆင့်မြင့်တင်မည်
