Repository: mayjuno/Django-MM-Ecommerce-Queen-Site
Catalog: home/locale/*/LC_MESSAGES/django.po
Languages: my

source: Home
my: မူလစာမျက်နှာ

source: About
my: ကျွန်ုပ်တို့အကြောင်း

source: results
my: ရလဒ်များ

source: Product List
my: ပစ္စည်းအမည်စာရင်း

source: Product
my: ပစ္စည်းအမည်

source: Category
my: အမျိုးအမည်

source: Price
my: ဈေးနှုန်း

source: Quantity
my: အရေအတွက်

source: Add to Cart
my: ဈေးခြင်းတောင်းသို့

source: Contact Us
my: ကျွန်ုပ်တို့အားဆက်သွယ်ရန်

source: Contact Form
my: ဆက်သွယ်ရန်ပုံစံ

source: Contact Information
my: ဆက်သွယ်ရန် အချက်အလက်

source: Latest Products
my: နောက်ဆုံးထွက်ပစ္စည်းများ

source: Quick view
my: ကြည့်ရှုမည်

source: Details
my: အသေးစိတ်

source: Picked For You
my: သင့်အတွက်ရွေးချယ်မှုများ

source: Frequently Asked Questions
my: မကြာခနမေးလေ့ရှိသောမေးခွန်းများ

source: Welcome to Queen Silk & Cotton Wears House!
my: မိဖုရား ပိုးထည် နှင့် ချည်ထည်မှ ကြိုဆိုပါ၏ ။

source: Store
my: စတိုး

source: Newsletter
my: ဝင်စာအသစ်

source: FAQ
my: မကြာခနမေးလေ့ရှိသောမေးခွန်းများ

source: enlogo
my: mylogo

source: All Categories
my: အမျိုးအမည်

source: Login
my: ဝင်မည်

source: Sign Up
my: မှတ်ပုံတင်မည်

source: My Account
my: ကျွန်ုပ်နေရာ

source: My Favorits
my: ကျွန်ုပ်အနှစ်သက်ဆုံးများ

source: My Order
my: ကျွန်ုပ်၏မှာယူမှု

source: My Comment
my: ကျွန်ုပ်၏မှတ်ချက်

source: Logout
my: ထွက်ခွါမည်

source: My Cart
my: ဈေးခြင်းတောင်း

source: Review(s) / Add Review
my: သုံးသပ်ချက် / သုံးသပ်ချက်ရေးရန်

source: Brand
my: အမှတ်တံဆိပ်

source: Queen Silk & Cotton Wears
my: မိဖုရား ပိုးထည် နှင့် ချည်ထည်

source: Size
my: အရွယ်အစား

source: Color
my: အရောင်

source: Availability
my: ရရှိနိုင်မှု

source: In Stock
my: ဈေးကွက်တွင်ရှိ

source: Out of Stock
my: ဈေးကွက်တွင်မရှိ

source: Selected
my: ရွေးချယ်မှု

source: QTY
my: အရေအတွက်

source: Reviews
my: သုံးသပ်ချက်များ

source: Write Your Review
my: သင့်သုံးသပ်ချက်ရေးရန်

source: Your Rating
my: သင့်ထောက်ခံမှု

source: Categories
my: အမျိုးအမည်များ

source: About Us
my: ကျွန်ုပ်တို့အကြောင်း

source: Shop Now
my: အခုဝယ်မည်
