Repository: mayjuno/Django-MM-Ecommerce-Queen-Site
Catalog: order/locale/*/LC_MESSAGES/django.po
Languages: my

source: Home
my: မူလစာမျက်နှာ

source: Order Complated
my: မှာယူမှု

source: Dear
my: လေးစားအပ်ပါသော

source: Your order is completed
my: သင့်မှာယူမှု ပြီးပါပြီ

source: Order Code
my: မှာယူမှုနာမ်ပါတ်

source: Thank You
my: ကျေးဇူးအထူးတင်ပါသည်

source: Order Page
my: မှာယူမှုစာမျက်နှာ

source: Shipping Details
my: ပို့ဆောင်မှုအခြေအနေအသေးစိတ်

source: First name
my: အမည်

source: Last name
my: နောက်ဆုံးအမည်

source: Address
my: လိပ်စာ

source: Phone
my: ဖုန်းနာပါတ်

source: City
my: မြို့

source: NayPyiDaw
my: နေပြည်တော်

source: Yangon
my: ရန်ကုန်

source: Mandalay
my: မန္တလေး

source: Mawlamaying
my: မော်လမြိုင်

source: MyitKyiNar
my: မြစ်ကြီးနား

source: MoneYwar
my: မုံရွာ

source: Country
my: နိုင်ငံ

source: Complete Order
my: မှာယူမှု

source: Payment Information
my: ငွေပေးချေမှုစနစ်

source: Shopcart Product List
my: ငွေပေးချေမှုစနစ်

source: Product
my: ငွေပေးချေမှုစနစ်

source: Price
my: ဈေးနှုန်း

source: Quantity
my: အရေအတွက်

source: Total
my: ပေါင်း

source: SUBTOTAL
my: ပေါင်း

source: SHIPING
my: ပို့ဆောင်မှု

source: Free Shipping
my: အခမဲ့ပို့ဆောင်မှု

source: TOTAL
my: စုစုပေါင်း

source: Shopcart
my: ဈေးခြင်းတောင်း

source: Place Order
my: မှာယူမည်
